リバースエンジニアリング　下流工程の既存のソフトウェアから上流工程の設計をする
マッシュアップ　複数のコンテンツを取り込み、組み合わせて利用するサービス
例　地図情報と店舗の情報データを組み合わせて地図上に店舗の場所表示
コンカレントエンジニアリング　同時並行に実施して開発短縮する
CMMI　組織の成熟度を５段階に分けた

著作権（創作物）プログラミング言語、コーディング規約、アルゴリズムは保護対象外
音楽、映画、プログラムなどの知的っ創作物に付属する
死後７０年まで存続

特許権　特許を受けた発明を権利者が一定期間受けれる
　発明の内容記載した書類を願書とともに特許庁に提出し、
シンさを受ける必要あり　２０年間

プロジェクトマネジメント　プロジェクト管理し、予算内、期間内に終わらせるためのプロセス
工程の生産性
　ステップ　ソースコードの行数
　１人月　１人で１か月かかること
　生産性　人月あたりのステップ数
　例設計フェーズ　３０００ステップ/人月,開発フェーズ　2000step/ひと月 テスト3000step/ひとつき
で６０００step作成　6000/3000=2+6000/2000=3+6000/3000=2＝7ひとつき
なので生産性＝6000/7=857

ガントチャート　縦軸に作業項目、横軸に日程でせんで予定期間示した
マイルストンチャート　縦軸作業項目、横軸に書く作業の通過点（作業開始、中間報告、修了）セル内に実施する日程各

COCOMO法　ソフトウェア開発工数見積もり法

プロジェクトリスクマネジメント（特定、分析、計画）
ブレーンストーミング　批判なしで、自由に意見する
インタビュー　ステークホルダーに会い、りすくきく
デルファイ法　複数の専門家に聞く
